{
  "backend/main.mo": "Motoko canister defining menu items and orders with CRUD-like operations, including creating items, toggling availability, and placing orders.",
  "backend/migration.mo": "Migration utility converting old menu items to include a new 'available' field defaulting to true.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining global color tokens and dark mode variables.",
  "frontend/index.html": "Basic HTML entry point mounting the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages in the AppLayout component.",
  "frontend/src/components/AppHeader.tsx": "Header with site branding, navigation links, and cart icon showing item count.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapping content with header, backend connection banner, and footer.",
  "frontend/src/components/BackendConnectionBanner.tsx": "Alert banner that displays backend connection errors with retry support.",
  "frontend/src/features/cart/CartProvider.tsx": "React context managing cart state with reducer and localStorage persistence.",
  "frontend/src/features/cart/useCart.ts": "Provides cart state via context, with actions to modify items and compute totals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBackendConnectionStatus.ts": "Checks actor query state for connection errors and exposes a retry mechanism.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for menu, orders, and admin actions using the backend actor.",
  "frontend/src/index.css": "Tailwind config with custom light/dark color variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart UI with quantity controls, line totals, and navigation to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form, validation, order placement, and displays errors or redirects on success.",
  "frontend/src/pages/MenuManagementPage.tsx": "Admin page to create new menu items and toggle their availability using form inputs and mutation hooks.",
  "frontend/src/pages/MenuPage.tsx": "Customer-facing menu view that loads dishes, displays availability, and allows adding items to the cart.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays confirmation details for a specific order, including items, total price, and status.",
  "frontend/src/pages/OrderLookupPage.tsx": "Lets users enter an order ID and fetch its status with error handling for missing or unreachable orders.",
  "frontend/src/utils/orderStatus.ts": "Utility helpers for normalizing order status and mapping it to labels, messages, and UI variants.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, fonts, animations, and plugins.",
  "project_state.json": "Defines project metadata, feature list, known issues, and architectural notes for the Moms Kitchen app, including menu availability and deployment issues."
}